In [1]:
import pandas as pd
from numpy import nan as NA

In [17]:
data = pd.DataFrame([[1, 6, 3], [1, NA, NA], [1, 'str', 2.], [NA, 6, 3]])

In [18]:
data

     0    1    2
0  1.0    6  3.0
1  1.0  NaN  NaN
2  1.0  str  2.0
3  NaN    6  3.0

In [28]:
data = data.dropna()
data

     0    1    2
0  1.0    6  3.0
2  1.0  str  2.0

In [30]:
data[data[1].astype(str)>'6']

     0    1    2
2  1.0  str  2.0

In [17]:

data[data[0]>=1]

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN

In [23]:
str(NA)>'10'

True

In [11]:
def del1(x):
    x = x+2

In [14]:
x = 2
del1(x)
print(x)

2